import CHaser # 設定ファイルの読み込み

"""
=== 自由メモ ================================================================================================

クルクル　サーチするプログラム

=== お知らせ ================================================================================================

●行動準備について
   v = i.gr()
  この命令で、自分の周りの情報をvに取り込むことができる。
        [ ][x][x]
        [ ][C][I]
        [H][ ][ ]
      このときは [0, 2, 2, 0, 0, 3, 1, 0, 0] が取り込まれる。  0:空地、1:相手、2:ブロック、3：得点アイテム

●行動命令について
    内容は 　w : 歩く（walk）  l：広く見る（look）   s：遠くまで見る(search)    p : ブロックを置く（put）
    方向は 　u : 上（up）      r：右(right)          d：下(down)                l : 左(left)
    
       例) a = i.wu()
           a = i.ld()
           a = i.sr() 
           a = i.pl() 
       など
=================================================================================== メモ終わり ==========
"""



def main():
	v = [] # 自分の周りの情報を保存するリスト
	a = [] # 行動の結果を保存するリスト
	i = CHaser.Client() # サーバーと接続

	cnt = 0 #--------外側ですが、付け加える。
	while(True):
		v = i.gr() 
		print("v = ",v)
#■----ここからプログラムを考える-----■-------------------------------------------------------------------

		if cnt == 0:
			a = i.su()

		elif cnt == 1:
			a = i.sr()

		elif cnt == 2:
			a = i.sd()

		elif cnt == 3:
			a = i.sl()
			cnt = -1

		cnt = cnt + 1
 
#■----プログラムここまで-------------■-------------------------------------------------------------------
		print("a = ",a,"\n\n")

if __name__ == "__main__":
    main()

