import CHaser # 同じディレクトリに CHaser.py がある前提

"""
=== 自由メモ ================================================================================================

斜めに宝石があった場合

=== お知らせ ================================================================================================

●行動準備について
   v = i.gr()
  この命令で、自分の周りの情報をvに取り込むことができる。
        [ ][x][x]
        [ ][C][I]
        [H][ ][ ]
      このときは [0, 2, 2, 0, 0, 3, 1, 0, 0] が取り込まれる。  0:空地、1:相手、2:ブロック、3：得点アイテム

●行動命令について
    内容は 　w : 歩く（walk）  l：広く見る（look）   s：遠くまで見る(search)    p : ブロックを置く（put）
    方向は 　u : 上（up）      r：右(right)          d：下(down)                l : 左(left)
    
       例) a = i.wu()
           a = i.ld()
           a = i.sr() 
           a = i.pl() 
       など
=================================================================================== メモ終わり ==========
"""

def main():
	v = [] # 自分の周りの情報を保存するリスト
	a = [] # 行動の結果を保存するリスト
	i = CHaser.Client() # サーバーと接続

	while(True):
		v = i.gr() 
		print("v = ",v)
#■----ここからプログラムを考える-----■-------------------------------------------------------------------

		#------------------相手がいる方向にブロックを置く
		if v[1] == 1:
			a = i.pu()

		elif v[3] == 1:
			a = i.pl()

		elif v[5] == 1:
			a = i.pr()

		elif v[7] == 1:
			a = i.pd()

		#------------------宝石がある方向に動く
		elif v[1] == 3:
			a = i.wu()

		elif v[3] == 3:
			a = i.wl()

		elif v[5] == 3:
			a = i.wr()

		elif v[7] == 3:
			a = i.wd()
		#------------------斜めに宝石があって取れる場合

		elif v[8] == 3 and v[5] == 0:
			a = i.wr()

		#------------------何もない方向に動く
		elif v[1] == 0:
			a = i.wu()

		elif v[3] == 0:
			a = i.wl()

		elif v[5] == 0:
			a = i.wr()

		elif v[7] == 0:
			a = i.wd()

		else:
			a = i.lu()


#■----プログラムここまで-------------■-------------------------------------------------------------------
		print("a = ",a,"\n\n")

if __name__ == "__main__":
    main()

